# Задание №17320
## Логическая функция F задаётся выражением ((x ∧ y) ∨ (y ∧ z)) ≡ ((x → w) ∧ (w → z)). Дан частично заполненный фрагмент, содержащий неповторяющиеся строки таблицы истинности функции F. Определите, какому столбцу таблицы истинности соответствует каждая из переменных x, y, z, w.
       print("x y z w")
    for x in range(0, 2):
    for y in range(0, 2):
        for z in range(0, 2):
            for w in range(0, 2):
                if ((x and y) or (y and z)) == ((x <= w) and (w <=z)):
                    print(x, y, z, w)
 

# Ответ: x w z y

# Задание №18483
## Логическая функция F задаётся выражением ((y → w) ≡ (x → ¬z)) ∧ (x ∨ w). Дан частично заполненный фрагмент, содержащий неповторяющиеся строки таблицы истинности функции F. Определите, какому столбцу таблицы истинности соответствует каждая из переменных x, y, z, w.
    print("x y z w")
    for x in range(0, 2):
    for y in range(0, 2):
        for z in range(0, 2):
            for w in range(0, 2):
                if not(((y <= w) == (x <= (not z))) and (x or w)):
                    print(x, y, z, w)

# Ответ: y z w x

# Задание №18550
## Логическая функция F задаётся выражением ((y → z) ∨ (¬x ∧ w)) ≡ (w ≡ z). Дан частично заполненный фрагмент, содержащий неповторяющиеся строки таблицы истинности функции F. Определите, какому столбцу таблицы истинности соответствует каждая из переменных x, y, z, w.
     print("x y z w")
    for x in range(0, 2):
    for y in range(0, 2):
        for z in range(0, 2):
            for w in range(0, 2):
                if ((y <= z) or (not x and w)) == (w == z):
                    print(x, y, z, w)

# Ответ: z w y x

# Задание  №9796
## Игорь составляет таблицу кодовых слов для передачи сообщений, каждому сообщению соответствует своё кодовое слово. В качестве кодовых слов Игорь использует 5-⁠буквенные слова, в которых есть только буквы A, B, C, X, причём буква X появляется ровно 1 раз. Каждая из других допустимых букв может встречаться в кодовом слове любое количество раз или не встречаться совсем. Сколько различных кодовых слов может использовать Игорь?
       import itertools 
    alphabet = "ABCX"
    ar = itertools.product(alphabet, repeat=5) #Размещение с повторением
    arl = []
    for i in ar:
    arl.append(list(i))
    count = 0
    for e in arl:
    if e.count('X') == 1:
        count += 1
print(count)
# Ответ: 405

# Задание №10500
## Шифр кодового замка представляет собой последовательность из пяти символов, каждый из которых является цифрой от 1 до 5. Сколько различных вариантов шифра можно задать, если известно, что цифра 1 встречается ровно три раза, а каждая из других допустимых цифр может встречаться в шифре любое количество раз или не встречаться совсем?
       from itertools import product 
    alphabet = '12345'
    count=0
    for i in product(alphabet, repeat=5):    
    if i.count('1') == 3:
        count += 1
    print(count)
# Ответ: 160

# Задание №3233
## Все 5-⁠буквенные слова, составленные из букв А, К, Р, У, записаны в алфавитном порядке. Вот начало списка:

## 1.  ААААА

## 2.  ААААК

## 3.  ААААР

## 4.  ААААУ

## 5.  АААКА

# Запишите слово, которое стоит на 250-⁠м месте от начала списка.

    a = {0: "А", 1: "К", 2: "Р", 3: "У"}
    k = 0
    for i in range(0, len(a)):
    for j in range(0, len(a)):
        for g in range(0, len(a)):
            for m in range(0, len(a)):
                for n in range(0, len(a)):
                    k += 1
                    if k == 250:
                        print(a[i], a[j], a[g], a[m], a[n], end=" ")

# Ответ: A Y Y P K
